Revit 2027 API
AnnotationLabelParameterFormatting.SampleText Property
 The sample text to show in the label in the family environment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SampleText { get; }
Public ReadOnly Property SampleText As String
	Get
public:
property String^ SampleText {
	String^ get ();
}
member SampleText : string with get
Property Value
String
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace